{
  "version": "3.0-master-en",
  "metadata": {
    "total_programs": 29,
    "total_blocks": 190,
    "total_questions": 650,
    "source_file": "research/Ты методолог по дизайну рефлексивных опросников..md",
    "cleaned_at": "2025-12-02T10:55:17.822515",
    "removed_garbage": 17,
    "unified_at": "2025-12-02T17:20:58.479333",
    "questions_improved": 315,
    "metadata_added": 369
  },
  "programs": [
    {
      "name": "Think About Life",
      "blocks": [
        {
          "name": "Here and Now",
          "description": "where I am now",
          "type": "Foundation",
          "questions": [
            {
              "text": "Describe your current state in three words?"
            },
            {
              "text": "What does your typical morning look like?"
            },
            {
              "text": "What do you do when you have free time and no one expects anything from you?"
            },
            {
              "text": "When was the last time you felt completely energized and full of vitality? What was happening around you?"
            }
          ]
        },
        {
          "name": "People Around Me",
          "description": "who influences me",
          "type": "Exploration",
          "questions": [
            {
              "text": "Who has had a particularly strong influence on you? What exactly did this person do or provide for you?"
            },
            {
              "text": "With whom have you been spending the most time lately?"
            },
            {
              "text": "Do these people help you grow and develop, or do they hold you back and keep you stuck where you are?"
            },
            {
              "text": "What do you never discuss with your family?"
            },
            {
              "text": "What makes you feel unique compared to your family?"
            }
          ]
        },
        {
          "name": "Dreams and Ambitions",
          "description": "where I want to arrive",
          "type": "Exploration",
          "questions": [
            {
              "text": "How do you envision your ideal day off? Where do you spend your time, what do you do, and whom do you spend it with?"
            },
            {
              "text": "What do you dream of when you imagine financial freedom?"
            },
            {
              "text": "What would you like to learn first?"
            },
            {
              "text": "Why do you want to go there specifically?"
            },
            {
              "text": "What would motivate you to wake up at the crack of dawn?"
            },
            {
              "text": "Imagine you've made the world a better place. What specifically has changed?"
            }
          ]
        },
        {
          "name": "Values and Beliefs",
          "description": "what is important to me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What values have you set for yourself? Write down at least three."
            },
            {
              "text": "What makes you unique compared to your family and close friends?"
            },
            {
              "text": "Complete this sentence: \"If people knew that I really..., they would..."
            },
            {
              "text": "Do you love yourself?"
            },
            {
              "text": "What is your relationship with yourself like? Do you treat yourself with warmth or criticism? What influences this relationship?"
            }
          ]
        },
        {
          "name": "Defense and Self-Deception",
          "description": "what I'm hiding from",
          "type": "Exploration",
          "questions": [
            {
              "text": "From what are you trying to protect yourself when you deceive yourself?"
            },
            {
              "text": "What must you free yourself from before your next breakthrough?"
            },
            {
              "text": "What deep fears do you face in your life?"
            },
            {
              "text": "What scares you the most about being close to other people?"
            }
          ]
        },
        {
          "name": "The Past",
          "description": "my journey until today",
          "type": "Exploration",
          "questions": [
            {
              "text": "Who were you a year ago? Who are you now? How have you changed?"
            },
            {
              "text": "How would you rate your past year across the main areas of life on a scale from 1 to 10? What significant events in each area influenced your rating?"
            },
            {
              "text": "Identify three habits that benefited you this year. How did they support you?"
            },
            {
              "text": "Think of 2-3 times when things didn't go as expected. What good ultimately came from those situations in your life?"
            },
            {
              "text": "What were you unable to achieve this year, and why? What are your thoughts about it now?"
            },
            {
              "text": "Are you still angry at yourself for something or unable to forgive yourself for it?"
            }
          ]
        },
        {
          "name": "Pride and Meaning",
          "description": "what I am proud of",
          "type": "Integration",
          "questions": [
            {
              "text": "What are you proudest of?"
            },
            {
              "text": "If you had only one year left to live, how would you spend it?"
            },
            {
              "text": "If everything lost its meaning tomorrow, what would you regret the most?"
            }
          ]
        },
        {
          "name": "Vision of the Future",
          "description": "who I want to become",
          "type": "Integration",
          "questions": [
            {
              "text": "Imagine your future self—the person you aspire to become in what matters most to you. What advice would that version of you give to your current self?"
            },
            {
              "text": "If your parents could truly see you, what would they understand?"
            },
            {
              "text": "What do you want most right now?"
            }
          ]
        }
      ]
    },
    {
      "name": "Think About Career or Business",
      "blocks": [
        {
          "name": "Where I am now",
          "description": "my work affairs",
          "type": "Foundation",
          "questions": [
            {
              "text": "In which field are you currently working or studying?"
            },
            {
              "text": "How long have you been in this field?"
            },
            {
              "text": "Do you have relevant education in your current field?"
            },
            {
              "text": "Do you work in the office, remotely, or through a hybrid model?"
            },
            {
              "text": "What is your current work schedule like?"
            }
          ]
        },
        {
          "name": "Satisfaction",
          "description": "do I like my job?",
          "type": "Exploration",
          "questions": [
            {
              "text": "On a scale of 1 to 10, how satisfied are you with your work right now?"
            },
            {
              "text": "How do you feel about your work? What resonates with you, and what doesn't?"
            },
            {
              "text": "How well do your personal values align with the corporate culture of your organization?"
            },
            {
              "text": "Do you ever find yourself criticizing yourself for taking time to rest, even when you work hard?"
            }
          ]
        },
        {
          "name": "Goals and Dreams",
          "description": "my dreams about work",
          "type": "Exploration",
          "questions": [
            {
              "text": "What does your dream job look like?"
            },
            {
              "text": "What would you do for work if all jobs paid the same?"
            },
            {
              "text": "What would you do if money weren't a limitation?"
            },
            {
              "text": "Imagine: In five years, you run into an old friend. What would you proudly tell them about your work?"
            },
            {
              "text": "If you knew you would definitely succeed, what would you start doing right now?"
            }
          ]
        },
        {
          "name": "Barriers and Resources",
          "description": "what hinders and what helps",
          "type": "Exploration",
          "questions": [
            {
              "text": "What, specifically, about your current job is holding you back from reaching your professional goals?"
            },
            {
              "text": "If you need a mentor in your work, who might that be, and how can you find such a person?"
            },
            {
              "text": "If you decide to stop working tomorrow, how long could you live on your savings?"
            },
            {
              "text": "Where exactly does your money go right now: toward your future (investments, education, development) or toward your present (purchases, entertainment, comfort)?"
            }
          ]
        },
        {
          "name": "Choices and Actions",
          "description": "my next steps",
          "type": "Exploration",
          "questions": [
            {
              "text": "If you decided to make a change in your career, where would you like to work?"
            },
            {
              "text": "Imagine a scale: on one side, rejections from job interviews; on the other, working somewhere you're not valued. Which would be more important for you to avoid?"
            },
            {
              "text": "What gives you confidence that your idea will work? What data, experience, or observations support your choice?"
            },
            {
              "text": "If you had all the resources you needed—time, money, and connections—what would you want to do, and how would you spend your time?"
            }
          ]
        },
        {
          "name": "Business Metrics (for Entrepreneurs) 🤖",
          "description": "A psychological cluster focused on developing analytical thinking and data-driven decision-making skills essential for successful entrepreneurship. Helps entrepreneurs understand key performance indicators, financial metrics, and business analytics to optimize their ventures and make informed strategic decisions.",
          "type": "Integration",
          "questions": [
            {
              "text": "What is the cost of acquiring one new customer for your business?"
            },
            {
              "text": "Which key performance indicator (KPI) do you track in your business?"
            }
          ]
        }
      ]
    },
    {
      "name": "Think About Health",
      "blocks": [
        {
          "name": "Sleep and Recovery",
          "description": "my sleep and rest",
          "type": "Foundation",
          "questions": [
            {
              "text": "What time do you usually go to bed, and what time do you wake up?"
            },
            {
              "text": "How many hours do you typically sleep each night?"
            },
            {
              "text": "How do you usually feel in the mornings: energetic, sluggish, or drowsy?"
            },
            {
              "text": "What do you usually do in the hour before bed? Does it help you fall asleep?"
            },
            {
              "text": "Are you more of an early bird or a night owl, and what does this bring to your life?"
            }
          ]
        },
        {
          "name": "Physiology",
          "description": "what I eat and how I move",
          "type": "Exploration",
          "questions": [
            {
              "text": "How do you discern what your body needs and what it doesn't?"
            },
            {
              "text": "How much water do you drink per day? Do you notice a connection between the amount of water you drink and how you feel?"
            },
            {
              "text": "What types of physical activities bring you joy?"
            },
            {
              "text": "What is your relationship with your physical health? What does being healthy mean to you?"
            }
          ]
        },
        {
          "name": "Body Signals",
          "description": "what my body feels",
          "type": "Exploration",
          "questions": [
            {
              "text": "What happens to your body when you're exhausted? What are the first signals your body sends?"
            },
            {
              "text": "Where in your body do you most often feel tension building up? What is your body trying to tell you?"
            },
            {
              "text": "When was the last time you listened to your body and followed its signals instead of pushing through?"
            }
          ]
        },
        {
          "name": "The Meaning of Health",
          "description": "why do I need to be healthy",
          "type": "Integration",
          "questions": [
            {
              "text": "Why is having good health important to you? What does it provide for you?"
            },
            {
              "text": "If you had perfect health, what would change in your life?"
            }
          ]
        },
        {
          "name": "Future Health",
          "description": "where I want to get to",
          "type": "Integration",
          "questions": [
            {
              "text": "What changes in your health would you like to see in your life a year from now?"
            },
            {
              "text": "Where do you see yourself health-wise in one year? How will you feel?"
            },
            {
              "text": "What kind of rest do your body and soul need? Where and how would you like to recharge your energy?"
            }
          ]
        }
      ]
    },
    {
      "name": "Know Yourself",
      "blocks": [
        {
          "name": "Archetypes and Models",
          "description": "who influenced me",
          "type": "Foundation",
          "questions": [
            {
              "text": "Who has had the strongest influence on you, and what qualities or approaches of theirs do you find in yourself?"
            },
            {
              "text": "Whom do you admire most, and why this person specifically?"
            }
          ]
        },
        {
          "name": "Energy and Resources",
          "description": "where I get my strength from",
          "type": "Exploration",
          "questions": [
            {
              "text": "How would you describe your current energy state in three words?"
            },
            {
              "text": "When was the last time you felt completely alive and full of energy? What was happening in your life at that moment?"
            },
            {
              "text": "What are the three actions or situations that restore your energy the fastest?"
            }
          ]
        },
        {
          "name": "Values through pride",
          "description": "what I am proud of",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are you most proud of, and why does this matter so much to you personally?"
            },
            {
              "text": "What qualities or traits do you know better than anyone else about yourself but rarely discuss?"
            }
          ]
        },
        {
          "name": "Desires and Fears",
          "description": "what I want and fear",
          "type": "Exploration",
          "questions": [
            {
              "text": "What do you most want right now?"
            },
            {
              "text": "What fear resides deep within your soul? What is it trying to protect?"
            }
          ]
        },
        {
          "name": "Ideal Future",
          "description": "who I want to become",
          "type": "Integration",
          "questions": [
            {
              "text": "Describe your ideal relaxation day: Where would you be, who would you be with, and what would you be doing?"
            },
            {
              "text": "Imagine you've changed the world for the better. What specifically has changed because of you?"
            },
            {
              "text": "If you knew you couldn't fail, what would you do?"
            }
          ]
        },
        {
          "name": "Development and Path",
          "description": "where I'm growing towards",
          "type": "Integration",
          "questions": [
            {
              "text": "What do you want to learn first and foremost, and why is it important to you at this moment?"
            },
            {
              "text": "Where in the world would you like to go, and what draws you there?"
            },
            {
              "text": "What skill or quality would you like to develop over the next year?"
            }
          ]
        }
      ]
    },
    {
      "name": "Improve Emotional State",
      "blocks": [
        {
          "name": "Emotion Map",
          "description": "do I like my work?",
          "type": "Foundation",
          "questions": [
            {
              "text": "Which emotions do you notice most often throughout your day?"
            },
            {
              "text": "Identify one emotion that surprises you with how frequently it appears."
            },
            {
              "text": "Is there an emotion that constantly resides in your body, like background noise?"
            }
          ]
        },
        {
          "name": "Embodiment of Emotions",
          "description": "what my body is telling me",
          "type": "Exploration",
          "questions": [
            {
              "text": "Where do you feel joy in your body? Describe the sensation: is it a feeling of warmth, lightness, or expansion?"
            },
            {
              "text": "Think of a moment when you were overwhelmed with gratitude. What did you feel in your body?"
            },
            {
              "text": "What emotions bring you peace and harmony, and how do they manifest in your body?"
            },
            {
              "text": "Where in your body does the emotion you can't express in words reside?"
            }
          ]
        },
        {
          "name": "Awareness of Feelings",
          "description": "what I am feeling right now",
          "type": "Exploration",
          "questions": [
            {
              "text": "How well do you notice your feelings when they arise? Rate yourself from 1 to 10."
            },
            {
              "text": "Do you allow yourself to simply feel what's there, or do you often think you're not supposed to feel this?"
            },
            {
              "text": "Which emotions do you allow yourself to feel only when you're completely alone?"
            },
            {
              "text": "When someone asks, \"What are you feeling?\" is your first impulse to answer honestly or to say what they expect to hear?"
            }
          ]
        },
        {
          "name": "Defenses and Masks",
          "description": "my masks and shields",
          "type": "Exploration",
          "questions": [
            {
              "text": "Do you use humor or sarcasm to express or hide your feelings?"
            },
            {
              "text": "Are there emotions you display as a substitute for your true feelings?"
            }
          ]
        },
        {
          "name": "Emotions as Information",
          "description": "what my feelings are whispering to me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are your regular feelings telling you?"
            },
            {
              "text": "If your anxiety were a wise teacher, what lessons would it be imparting to you?"
            },
            {
              "text": "Which emotion do you often label as bad, despite it actually trying to help you?"
            }
          ]
        },
        {
          "name": "Mood as a Choice",
          "description": "How to manage your mood",
          "type": "Integration",
          "questions": [
            {
              "text": "What kind of mood would you like to set for yourself in the morning before your day begins?"
            },
            {
              "text": "How do you regain balance when emotions overwhelm you?"
            }
          ]
        }
      ]
    },
    {
      "name": "Reviewing Goals",
      "blocks": [
        {
          "name": "Goal Inventory",
          "description": "my goals for today",
          "type": "Foundation",
          "questions": [
            {
              "text": "List all the goals you are currently pursuing (professional, personal, financial)."
            },
            {
              "text": "Where did each of these goals come from: your own choices or other people's expectations?"
            },
            {
              "text": "Which goal is it time to let go of—one that no longer serves or inspires you?"
            },
            {
              "text": "Perhaps the goals weighing you down are no longer relevant to your life?"
            }
          ]
        },
        {
          "name": "Goal Verification",
          "description": "which of the goals are alive",
          "type": "Exploration",
          "questions": [
            {
              "text": "Choose one goal that’s important to you. What is your confidence based on that this specific path will lead you to the result?"
            },
            {
              "text": "What specific data or experience gives you confidence in achieving this goal? What makes you believe it is actually attainable?"
            },
            {
              "text": "Could there be a more effective approach to achieving the same goal? What would help you determine this?"
            },
            {
              "text": "Do your goals inspire you, or do they make you feel anxious instead?"
            }
          ]
        },
        {
          "name": "Professional Goals",
          "description": "what I want from work",
          "type": "Exploration",
          "questions": [
            {
              "text": "What is your dream job? Picture it in detail: where it takes place, what it involves, and the kind of people you interact with."
            },
            {
              "text": "Which aspects of your current job are already helping you progress toward your career goals, and what else can you do to advance further?"
            },
            {
              "text": "What is it specifically about your current job that prevents you from achieving your career goals?"
            },
            {
              "text": "How much does your current job help you move toward your professional goals?"
            }
          ]
        },
        {
          "name": "Achievements and Pride",
          "description": "what I am proud of",
          "type": "Integration",
          "questions": [
            {
              "text": "What are your most proud achievements?"
            },
            {
              "text": "Which achievement surprised you the most—something you didn't expect you could accomplish?"
            }
          ]
        },
        {
          "name": "Prioritization",
          "description": "what matters most right now",
          "type": "Exploration",
          "questions": [
            {
              "text": "If you could achieve only three goals out of all the ones you have, which would they be?"
            },
            {
              "text": "How will you know you're moving toward your goals in the right direction?"
            }
          ]
        },
        {
          "name": "Action",
          "description": "my action plan",
          "type": "Integration",
          "questions": [
            {
              "text": "What specific step can you take this week to get closer to your main goal?"
            },
            {
              "text": "Who or what could help you get closer to this goal? What resources and support do you need?"
            }
          ]
        }
      ]
    },
    {
      "name": "Dreamers",
      "blocks": [
        {
          "name": "What is a dream for me",
          "description": "what does it mean to dream",
          "type": "Foundation",
          "questions": [
            {
              "text": "Think back to your childhood: what did you dream about then? What has changed since?"
            },
            {
              "text": "What is your main dream right now?"
            },
            {
              "text": "Is this truly your dream, or is it something you once heard from others and adopted as your own?"
            },
            {
              "text": "To what extent are you living your dream life right now?"
            }
          ]
        },
        {
          "name": "Reality Testing",
          "description": "what is realistically achievable",
          "type": "Exploration",
          "questions": [
            {
              "text": "Do you know someone who is already living a similar lifestyle or working in a field that interests you? What helped them achieve it?"
            },
            {
              "text": "Could your dream be based on limited information? What would help you understand its reality more deeply?"
            },
            {
              "text": "If you had all the opportunities and resources available, what would you do first?"
            }
          ]
        },
        {
          "name": "Dream House",
          "description": "what my dream looks like",
          "type": "Exploration",
          "questions": [
            {
              "text": "If all your problems were solved and everything in your life fell into place, where would you live, and what would your dream home look like?"
            },
            {
              "text": "Imagine your dream home. What makes it special? Describe 3 to 5 details that make it uniquely yours."
            },
            {
              "text": "What small, safe step can you take today to move closer to your dream home?"
            }
          ]
        },
        {
          "name": "Dream Job",
          "description": "where to work with joy",
          "type": "Exploration",
          "questions": [
            {
              "text": "How do you envision your dream job? Describe it as specifically as possible."
            },
            {
              "text": "What would need to change in your life for you to pursue your dream job?"
            },
            {
              "text": "Who can help you get closer to your dream job? What contacts, knowledge, or resources do you need?"
            }
          ]
        },
        {
          "name": "Money and Investments",
          "description": "where does my money go",
          "type": "Exploration",
          "questions": [
            {
              "text": "Where exactly is your money going right now: into your future (investments, education, assets) or into your present (comfort, entertainment, purchases)?"
            },
            {
              "text": "What percentage of your income do you invest in making your dreams come true?"
            },
            {
              "text": "If you could allocate 10% of your income to make your dream come true, what would you spend it on?"
            }
          ]
        },
        {
          "name": "Action",
          "description": "my first step today",
          "type": "Integration",
          "questions": [
            {
              "text": "What specific step can you take this week to get closer to your dream?"
            },
            {
              "text": "If you don't take action, how do you envision your life in a few years? What would be your most painful regret?"
            },
            {
              "text": "When would you like to start? Is there a suitable day this week?"
            }
          ]
        }
      ]
    },
    {
      "name": "Reflection",
      "blocks": [
        {
          "name": "What I Learned About Myself",
          "description": "What I understood about myself",
          "type": "Foundation",
          "questions": [
            {
              "text": "What self-discovery turned out to be the most unexpected?"
            },
            {
              "text": "What did you discover about yourself that you didn’t know before reflecting on this?"
            },
            {
              "text": "What beliefs about yourself have you recently reconsidered or changed?"
            }
          ]
        },
        {
          "name": "Freedom and Changes",
          "description": "what has changed in me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What freedom arises from a new understanding of yourself?"
            },
            {
              "text": "What do you now permit yourself to do that you didn't before?"
            },
            {
              "text": "What are you willing to give up? What in your life no longer serves you?"
            }
          ]
        },
        {
          "name": "Action",
          "description": "what do I do next",
          "type": "Exploration",
          "questions": [
            {
              "text": "Based on your new insights, what action are you ready to take today?"
            },
            {
              "text": "With whom can you share your new self-discoveries? Who is willing to support you on this journey?"
            }
          ]
        },
        {
          "name": "Continuing the Path",
          "description": "where I'm going now",
          "type": "Integration",
          "questions": [
            {
              "text": "What question should you ask yourself regularly?"
            },
            {
              "text": "When will you engage in self-reflection again? In a month, a quarter, or a year?"
            }
          ]
        }
      ]
    },
    {
      "name": "3 Pillars of Purification",
      "blocks": [
        {
          "name": "Acceptance",
          "description": "what I am ready to accept",
          "type": "Foundation",
          "questions": [
            {
              "text": "Which part of yourself did you once reject but were able to accept over time?"
            },
            {
              "text": "How did your life change when you accepted what you used to fight against?"
            },
            {
              "text": "Which part of you is still waiting to be accepted?"
            }
          ]
        },
        {
          "name": "Letting Go",
          "description": "what you are ready to let go of",
          "type": "Exploration",
          "questions": [
            {
              "text": "What have you been able to let go of this year—beliefs, habits, or relationships?"
            },
            {
              "text": "What happens to you when you let something go? How does this change your inner state?"
            },
            {
              "text": "What are you holding onto right now, even though you know it's time to let go?"
            }
          ]
        },
        {
          "name": "Transformation",
          "description": "how I change",
          "type": "Integration",
          "questions": [
            {
              "text": "When was the last time your growth came not through achievements, but through accepting and letting go of what wasn't working?"
            },
            {
              "text": "What new aspects of yourself have you discovered through this cleansing process?"
            },
            {
              "text": "What have you become after this cycle of purification, and what has changed within you?"
            }
          ]
        },
        {
          "name": "Integration",
          "description": "what will change in life",
          "type": "Integration",
          "questions": [
            {
              "text": "How could this new understanding impact your decisions both in the near and distant future?"
            },
            {
              "text": "What concrete step are you ready to take today, building on this purification?"
            },
            {
              "text": "What new knowledge or skills could enhance your purification experience and make it more integrated?"
            }
          ]
        }
      ]
    },
    {
      "name": "Resource",
      "blocks": [
        {
          "name": "People as a Resource",
          "description": "who supports me",
          "type": "Foundation",
          "questions": [
            {
              "text": "Who has had a particularly strong influence on you, and what exactly did this person do or say?"
            },
            {
              "text": "Who would you say your main source of support is right now?"
            },
            {
              "text": "Whom can you rely on during tough times, and why specifically these people?"
            },
            {
              "text": "Who believes in you, even when you doubt yourself?"
            }
          ]
        },
        {
          "name": "Internal Resources",
          "description": "what gives me strength",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are you most proud of, and why is this important to you?"
            },
            {
              "text": "What is your main strength, and how do you use it?"
            },
            {
              "text": "What past experience helps you now, and what did it teach you?"
            },
            {
              "text": "What are the three qualities you consider to be your greatest strengths?"
            }
          ]
        },
        {
          "name": "Material Resources",
          "description": "what I have",
          "type": "Exploration",
          "questions": [
            {
              "text": "What material resources do you have available: money, assets, education, connections?"
            },
            {
              "text": "How are you currently using your resources—time, energy, and finances? What's working well for you, and what would you like to change?"
            },
            {
              "text": "Which resources—time, money, or energy—do you have in abundance, and which ones are you lacking for what truly matters to you?"
            }
          ]
        },
        {
          "name": "Time and Energy",
          "description": "where my strength goes",
          "type": "Exploration",
          "questions": [
            {
              "text": "What do you spend most of your time on, and does it benefit you?"
            },
            {
              "text": "Which activities energize you, and how often do you engage in them?"
            },
            {
              "text": "What activities drain your energy the most? Can you change that?"
            }
          ]
        },
        {
          "name": "Resource Development",
          "description": "how to become stronger",
          "type": "Integration",
          "questions": [
            {
              "text": "Which resource would you like to develop first?"
            },
            {
              "text": "What steps should you take to gain access to new resources?"
            },
            {
              "text": "To whom or what can you turn to expand your opportunities for growth?"
            }
          ]
        }
      ]
    },
    {
      "name": "Personal Boundaries",
      "blocks": [
        {
          "name": "What is a boundary for me",
          "description": "what it means to dream",
          "type": "Foundation",
          "questions": [
            {
              "text": "Where do you often let people cross your boundaries?"
            },
            {
              "text": "Why do you allow this—out of fear, politeness, or habit?"
            },
            {
              "text": "With whom do you find it easier to set boundaries, and with whom is it more difficult? Why?"
            }
          ]
        },
        {
          "name": "Personal Boundaries",
          "description": "my \"yes\" and \"no\"",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which of your desires no longer serve you?"
            },
            {
              "text": "Which goal is it time to let go of—one that no longer serves you?"
            },
            {
              "text": "Which ritual or habit would you like to introduce or change, and why?"
            },
            {
              "text": "Do you feel guilty when you break your own rules?"
            }
          ]
        },
        {
          "name": "Boundaries in relationships",
          "description": "where I open up to people",
          "type": "Exploration",
          "questions": [
            {
              "text": "With which of your close friends and family can you allow yourself to be vulnerable, and with whom do you feel the need to appear strong?"
            },
            {
              "text": "Whom do you allow to see your weakness and vulnerability?"
            },
            {
              "text": "For whom do you wear a mask, and why?"
            },
            {
              "text": "Who are the people who require you to always be at your best? Do you want to change this?"
            }
          ]
        },
        {
          "name": "Work Boundaries",
          "description": "where work ends and I begin",
          "type": "Exploration",
          "questions": [
            {
              "text": "How well do your work responsibilities align with your interests and values?"
            },
            {
              "text": "If you compare job rejections to working where you're not valued, what would tip the scales for you?"
            },
            {
              "text": "What specifically makes you the right person to handle this task, and who else could take care of it?"
            },
            {
              "text": "When was the last time you said no to extra work? What stopped you from doing it sooner?"
            }
          ]
        },
        {
          "name": "Boundaries with Technology and Time",
          "description": "where my time goes",
          "type": "Exploration",
          "questions": [
            {
              "text": "When was the last time you spent a day without your phone or the internet?"
            },
            {
              "text": "Have you set boundaries for internet use in your life? What are they?"
            },
            {
              "text": "What did you do today to move closer to your main goals? And what might have been less important?"
            }
          ]
        },
        {
          "name": "Work-Life Boundary",
          "description": "The psychological boundary that separates professional responsibilities and activities from personal life, relationships, and leisure time. This boundary helps maintain mental health, prevents burnout, and ensures adequate time and energy allocation between work demands and personal well-being.",
          "type": "Exploration",
          "questions": [
            {
              "text": "Do you have a specific time when your workday ends?"
            },
            {
              "text": "If everything in your life lost its meaning tomorrow, what would you regret the most?"
            }
          ]
        },
        {
          "name": "Physical and Bodily Boundaries",
          "description": "what my body tells me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What physical personal boundaries do you consistently maintain, and which ones do you often violate?"
            },
            {
              "text": "Do you love yourself enough to let go of what's harmful to you?"
            }
          ]
        },
        {
          "name": "Action",
          "description": "my first steps",
          "type": "Integration",
          "questions": [
            {
              "text": "What boundary do you want to establish in the next month?"
            },
            {
              "text": "How would you know if this boundary is working? What signs would indicate this?"
            },
            {
              "text": "Whom would you ask to support you in establishing this boundary?"
            }
          ]
        }
      ]
    },
    {
      "name": "Working with Fears",
      "blocks": [
        {
          "name": "Getting to Know Fear",
          "description": "Do I like my work?",
          "type": "Foundation",
          "questions": [
            {
              "text": "What fear has lived inside you for so long that it’s become part of who you are?"
            },
            {
              "text": "How often does this fear arise? When is it triggered?"
            },
            {
              "text": "Where in your body do you feel fear?"
            },
            {
              "text": "Which potential future scenario causes you the most anxiety or worry?"
            }
          ]
        },
        {
          "name": "Facing Fear",
          "description": "what I feel when I'm scared",
          "type": "Exploration",
          "questions": [
            {
              "text": "Recall a moment when you faced your fear head-on. How did you feel?"
            },
            {
              "text": "What happens to your fear when you breathe through it? Does it become easier?"
            },
            {
              "text": "What warm and supportive words can you offer to your fear?"
            }
          ]
        },
        {
          "name": "Deep Fear Analysis",
          "description": "what lies behind fear",
          "type": "Exploration",
          "questions": [
            {
              "text": "If your fear could speak, what would it say about what it’s protecting?"
            },
            {
              "text": "If your anxiety were a wise teacher, what would it teach you?"
            },
            {
              "text": "Which part of you is no longer afraid of what used to frighten you?"
            }
          ]
        },
        {
          "name": "Specific Fears",
          "description": "my main fears",
          "type": "Exploration",
          "questions": [
            {
              "text": "What financial concerns keep you up at night?"
            },
            {
              "text": "What do you desire but are afraid to fully pursue?"
            },
            {
              "text": "Do you think others might feel awkward or afraid when interacting with you? If so, what do you think could be causing this?"
            }
          ]
        },
        {
          "name": "Fear and Motivation",
          "description": "what fear does to me",
          "type": "Exploration",
          "questions": [
            {
              "text": "Does your fear motivate you to move forward, or does it paralyze you?"
            },
            {
              "text": "When you avoid certain situations, what specifically frightens you about them: the real danger, or the possibility of discovering something new about yourself?"
            },
            {
              "text": "What are you avoiding so subtly that you don't even notice it?"
            }
          ]
        },
        {
          "name": "Fear in Relationships",
          "description": "intimacy scares me",
          "type": "Exploration",
          "questions": [
            {
              "text": "Do you give people your time and attention out of generosity, or from fear of being rejected?"
            },
            {
              "text": "What scares you more: showing your vulnerability or the risk that it might be used against you?"
            },
            {
              "text": "What scares you more: being alone or facing yourself?"
            },
            {
              "text": "If you weren't afraid of being alone, which relationships would you end?"
            }
          ]
        },
        {
          "name": "Existential fears",
          "description": "what I'm truly afraid of",
          "type": "Exploration",
          "questions": [
            {
              "text": "What do you fear more: the intensity of your emotions or their complete absence?"
            },
            {
              "text": "Who will you become when you stop being afraid?"
            },
            {
              "text": "What kind of person do you become when you choose love over fear?"
            }
          ]
        },
        {
          "name": "Unconscious fears",
          "description": "what I secretly fear",
          "type": "Exploration",
          "questions": [
            {
              "text": "What truth about yourself do you sense but aren't ready to face yet?"
            },
            {
              "text": "If your closest relationships could speak, what hidden struggles would they reveal about you?"
            }
          ]
        },
        {
          "name": "Action",
          "description": "what I am doing now",
          "type": "Integration",
          "questions": [
            {
              "text": "What small step could you take toward addressing what's troubling you?"
            },
            {
              "text": "Who or what resource could assist you in this work?"
            }
          ]
        }
      ]
    },
    {
      "name": "Understanding Relationships",
      "blocks": [
        {
          "name": "Map of My Relationships",
          "description": "my close and distant ones",
          "type": "Foundation",
          "questions": [
            {
              "text": "How many people truly know the real you? Who are they?"
            },
            {
              "text": "Who in your life makes you feel safe being yourself?"
            },
            {
              "text": "Who exemplifies harmonious and healthy relationships for you?"
            },
            {
              "text": "How satisfied are you with your friendships right now? Rate them on a scale from 1 to 10."
            }
          ]
        },
        {
          "name": "Successes and Resources in Relationships",
          "description": "my victories in love",
          "type": "Exploration",
          "questions": [
            {
              "text": "What aspect of relationship success are you proud of?"
            },
            {
              "text": "Think of a relationship where you felt truly seen. What made it special?"
            },
            {
              "text": "Consider someone who accepts you just as you are. How do you feel when you're with them?"
            },
            {
              "text": "Consider a relationship that helped you become a better person. What was healing about it?"
            },
            {
              "text": "How have you helped another person? What did that bring you?"
            }
          ]
        },
        {
          "name": "Patterns and Cycles",
          "description": "my recurring mistakes",
          "type": "Exploration",
          "questions": [
            {
              "text": "What patterns or behaviors have ruined your past relationships?"
            },
            {
              "text": "Which behavioral patterns keep repeating in your relationships?"
            },
            {
              "text": "Do you attract people who need help, or do you choose those you can help?"
            },
            {
              "text": "Do you genuinely forgive people, or do you pretend to forgive them to avoid conflict?"
            }
          ]
        },
        {
          "name": "Me in relationships",
          "description": "who I am when I'm with others",
          "type": "Exploration",
          "questions": [
            {
              "text": "Are there aspects of your personality that you prefer not to reveal in relationships?"
            },
            {
              "text": "With which of your close friends can you be vulnerable and authentic, and with whom do you feel the need to appear stronger?"
            },
            {
              "text": "Where in your body do you feel it when a relationship isn't right for you?"
            },
            {
              "text": "Do you choose intimacy with people, or intimacy with the image they have created of you?"
            },
            {
              "text": "Which part of yourself do you hide or keep hidden in your relationships with others?"
            }
          ]
        },
        {
          "name": "Love and Expression",
          "description": "my way of loving",
          "type": "Exploration",
          "questions": [
            {
              "text": "How do you show love to those close to you, and how do you want to receive it?"
            },
            {
              "text": "How do you express your love to those you care about?"
            },
            {
              "text": "Do you offer people your time and attention out of generosity, or is it out of fear of being rejected?"
            }
          ]
        },
        {
          "name": "Influence of Origin",
          "description": "what my parents gave me",
          "type": "Exploration",
          "questions": [
            {
              "text": "How do your relationships with your parents influence your romantic relationships?"
            },
            {
              "text": "What traits from the relationships in your childhood would you like to keep in your adult life, and what would you want to change?"
            },
            {
              "text": "How often and meaningfully do you communicate with your close family members? Does it enrich you?"
            }
          ]
        },
        {
          "name": "Vulnerability and Intimacy",
          "description": "to open up or defend yourself",
          "type": "Exploration",
          "questions": [
            {
              "text": "What prevents you from opening up to those close to you?"
            },
            {
              "text": "Do you seek understanding in relationships, or do you seek confirmation of what you already think about yourself?"
            },
            {
              "text": "If you weren't afraid of being alone, which relationships would you end?"
            }
          ]
        },
        {
          "name": "Transformation",
          "description": "who am I now",
          "type": "Exploration",
          "questions": [
            {
              "text": "Who do you become when you choose love over fear?"
            },
            {
              "text": "If your close relationships could speak, what would they reveal about what you feel you need to hide or protect?"
            }
          ]
        },
        {
          "name": "Action",
          "description": "what I will do next",
          "type": "Integration",
          "questions": [
            {
              "text": "How can you improve your relationship with someone close to you? What is the first step you are ready to take?"
            },
            {
              "text": "With whom are you ready to share something more personal about yourself this week?"
            },
            {
              "text": "What qualities do you want to develop in yourself for closer, more trusting relationships?"
            }
          ]
        }
      ]
    },
    {
      "name": "Burnout → Resource",
      "blocks": [
        {
          "name": "Signs of Burnout",
          "description": "what I feel and notice",
          "type": "Foundation",
          "questions": [
            {
              "text": "What happens to your body when you're exhausted? What signals is your body sending?"
            },
            {
              "text": "What emotion is hiding behind your chronic fatigue?"
            },
            {
              "text": "When do you feel anger but label it as tiredness or irritation?"
            },
            {
              "text": "When do your goals energize you, and when do they begin to drain you?"
            }
          ]
        },
        {
          "name": "Triggers and Patterns",
          "description": "what drains me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What in your life drains your energy the most?"
            },
            {
              "text": "When was the last time you felt truly rested—completely, without guilt or urgency?"
            },
            {
              "text": "What responsibilities do you assume out of a sense of duty, even though they don't inspire you?"
            }
          ]
        },
        {
          "name": "Recovery — Quick Methods",
          "description": "first aid for yourself",
          "type": "Exploration",
          "questions": [
            {
              "text": "What helps you quickly recover from stress and recharge your energy?"
            },
            {
              "text": "Which activities help you restore your energy best? (music, socializing, movement, nature, creativity)"
            },
            {
              "text": "What helps you quickly relax and restore your inner balance?"
            }
          ]
        },
        {
          "name": "Recovery — Deep Methods",
          "description": "what gives me strength",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which type of rest restores you most completely: physical, emotional, creative, or social?"
            },
            {
              "text": "What does your ideal weekend look like, and what energizes you while providing true rest?"
            },
            {
              "text": "Who helps you recharge your energy? How do you notice feeling more alive and vibrant when you're around them?"
            }
          ]
        },
        {
          "name": "Self-Support",
          "description": "how I embrace myself",
          "type": "Exploration",
          "questions": [
            {
              "text": "How do you support yourself during moments of exhaustion or when your energy is depleted?"
            },
            {
              "text": "What do you tell yourself when you feel burned out? Do you offer support or criticism?"
            },
            {
              "text": "Which restorative ritual would you like to introduce into your life?"
            }
          ]
        },
        {
          "name": "Balance and Boundaries",
          "description": "what I take and what I give",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are you willing to give up to make space for recovery?"
            },
            {
              "text": "What boundaries do you need to establish to avoid burnout?"
            },
            {
              "text": "How would your life change if you could rest as much as you work?"
            }
          ]
        },
        {
          "name": "Action",
          "description": "my first steps",
          "type": "Integration",
          "questions": [
            {
              "text": "What recovery ritual can you introduce this week?"
            },
            {
              "text": "To whom will you disclose your burnout and seek support?"
            },
            {
              "text": "If you had an entire day of unrestricted rest, how would you spend it?"
            }
          ]
        }
      ]
    },
    {
      "name": "Healing the Past",
      "blocks": [
        {
          "name": "Acknowledging What Was",
          "description": "My truth about the past",
          "type": "Foundation",
          "questions": [
            {
              "text": "What event from your past still resonates with you today?"
            },
            {
              "text": "What lesson did you learn from the most challenging period of your life?"
            },
            {
              "text": "What important thing have you learned recently?"
            },
            {
              "text": "How have you become stronger recently, and what has this provided you?"
            }
          ]
        },
        {
          "name": "Gratitude",
          "description": "what the past has given me",
          "type": "Exploration",
          "questions": [
            {
              "text": "Recall a moment when you were overwhelmed with gratitude. What sensations did you feel in your body?"
            },
            {
              "text": "For what can you be grateful in your past experiences?"
            },
            {
              "text": "How have you helped someone else, and what did you gain from it?"
            }
          ]
        },
        {
          "name": "People who helped heal",
          "description": "who was there for you",
          "type": "Exploration",
          "questions": [
            {
              "text": "Reflect on the relationships that helped you become a better person. What was healing about them?"
            },
            {
              "text": "Consider the relationships where you felt truly seen and accepted for who you are. What made these connections so special for your healing journey?"
            },
            {
              "text": "Think of someone who completely accepts you. What do you feel when you're with them?"
            },
            {
              "text": "With whom can you be silent and still feel understood?"
            },
            {
              "text": "Who in your life makes you feel safe being yourself?"
            }
          ]
        },
        {
          "name": "Forgiveness",
          "description": "how to let go of pain",
          "type": "Exploration",
          "questions": [
            {
              "text": "Whom haven't you forgiven yet—others or yourself?"
            },
            {
              "text": "Do you more often genuinely forgive people, or do you pretend to forgive to avoid confrontation?"
            },
            {
              "text": "If your sadness could speak, what would it say about your life?"
            },
            {
              "text": "What from your past are you ready to let go of to make space for what truly matters to you now?"
            }
          ]
        },
        {
          "name": "Past Emotions",
          "description": "what the body remembers",
          "type": "Exploration",
          "questions": [
            {
              "text": "Recall a past emotion that brought you peace. How did it feel in your body?"
            },
            {
              "text": "Which emotion from your past still lingers in your body, even if you can't find words for it?"
            },
            {
              "text": "What color, sound, or image is connected to your past emotional wound?"
            }
          ]
        },
        {
          "name": "Personal Identity Reframing",
          "description": "Who am I after everything I've been through",
          "type": "Integration",
          "questions": [
            {
              "text": "Who would you be if you stopped trying to meet others' expectations?"
            },
            {
              "text": "If no one knew you and you could start with a blank slate, who would you choose to be?"
            },
            {
              "text": "If there were no social expectations or limitations, what part of yourself would you allow to express more freely?"
            },
            {
              "text": "If you could be completely honest for one day, what would you say?"
            }
          ]
        },
        {
          "name": "Self-Vision",
          "description": "who I really am",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are you most proud of, and what makes this achievement especially valuable to you?"
            },
            {
              "text": "What achievements are you proud of? Big or small, everything matters."
            },
            {
              "text": "Who inspires you most, and why?"
            }
          ]
        },
        {
          "name": "Breaking Free from the Past",
          "description": "how to let go and move forward",
          "type": "Exploration",
          "questions": [
            {
              "text": "How are you feeling right now? What do you want most at this moment?"
            },
            {
              "text": "What would you like to make more room for in your life this year?"
            },
            {
              "text": "Where can you direct your energy to bring the greatest benefit to both yourself and those around you?"
            },
            {
              "text": "If everything lost its meaning tomorrow, what would your biggest regret be?"
            }
          ]
        },
        {
          "name": "Action and Future",
          "description": "my steps after pain",
          "type": "Integration",
          "questions": [
            {
              "text": "What is the simplest first step you can take to integrate this lesson from your past into your life?"
            },
            {
              "text": "Whom would you like to share your healing journey with? Who are the people for whom your story matters?"
            }
          ]
        }
      ]
    },
    {
      "name": "Body and Emotions",
      "blocks": [
        {
          "name": "Body Sensations Map",
          "description": "what my body is telling me",
          "type": "Foundation",
          "questions": [
            {
              "text": "Where in your body do you feel joy? Describe the sensation: warmth, lightness, and expansion."
            },
            {
              "text": "Consider a moment when you felt overwhelmed with gratitude. What did you feel in your body during that time?"
            },
            {
              "text": "Think of an emotion that brings you peace. How does it feel in your body?"
            },
            {
              "text": "Where in your body do you feel the deepest emotion that you can't express in words?"
            }
          ]
        },
        {
          "name": "Body Signals",
          "description": "what my body feels",
          "type": "Exploration",
          "questions": [
            {
              "text": "What emotions do you most often notice throughout your day?"
            },
            {
              "text": "Is there an emotion that constantly lingers in your body, like background noise?"
            },
            {
              "text": "What happens to your body when emotions become intense? What signals does your body send you?"
            },
            {
              "text": "What happens to your body when you feel tired or emotionally drained? What signals does your body send you?"
            }
          ]
        },
        {
          "name": "Emotions and Masks",
          "description": "my true feelings",
          "type": "Exploration",
          "questions": [
            {
              "text": "What emotions do you experience when you're alone that you don't show to others?"
            },
            {
              "text": "Do you use humor or sarcasm to express or hide your feelings?"
            },
            {
              "text": "When someone asks, what are you feeling? Is your first impulse to answer honestly or to say what they expect to hear?"
            },
            {
              "text": "What part of yourself are you hiding in your body by physically tensing your muscles or freezing?"
            }
          ]
        },
        {
          "name": "Attitude towards feelings",
          "description": "what I am feeling right now",
          "type": "Exploration",
          "questions": [
            {
              "text": "Do you allow yourself to simply feel what's there, or do you often think you should be feeling something else?"
            },
            {
              "text": "What kind and compassionate words can you offer your emotions instead of criticism?"
            },
            {
              "text": "What mood would you like to create for yourself in the morning? How might this feel in your body?"
            }
          ]
        },
        {
          "name": "Deep Layers",
          "description": "what my body tells me",
          "type": "Exploration",
          "questions": [
            {
              "text": "If your anxiety were a wise teacher, what might it be trying to teach you?"
            },
            {
              "text": "What are your regular feelings telling you?"
            },
            {
              "text": "What gentle and kind feelings can you cultivate toward yourself right now?"
            }
          ]
        },
        {
          "name": "Body Regulation",
          "description": "how the body heals me",
          "type": "Integration",
          "questions": [
            {
              "text": "How can you help your body manage intense emotions?"
            },
            {
              "text": "What movements or touches help you find your center again?"
            },
            {
              "text": "Do you notice how your breathing changes with different emotions? What happens to your body when you feel anxious or joyful?"
            }
          ]
        }
      ]
    },
    {
      "name": "Money and Self-Worth",
      "blocks": [
        {
          "name": "Origin of Beliefs",
          "description": "who influenced me",
          "type": "Foundation",
          "questions": [
            {
              "text": "What financial lessons did you learn from your parents? Both the beneficial and the less helpful ones—everything matters for understanding."
            },
            {
              "text": "What beliefs about money did you learn from your family and social environment, and how do they influence your life now?"
            },
            {
              "text": "How did your parents approach money, and what aspects of their attitude do you notice in yourself now?"
            }
          ]
        },
        {
          "name": "Current Beliefs",
          "description": "my rules about money",
          "type": "Foundation",
          "questions": [
            {
              "text": "What beliefs about money are living within you right now?"
            },
            {
              "text": "What beliefs do you currently hold about money, and how are they affecting your financial situation?"
            },
            {
              "text": "How do you relate to money—do you see it more as an opportunity or a limitation?"
            },
            {
              "text": "How do you handle money when you're stressed? What might this reveal about your beliefs?"
            }
          ]
        },
        {
          "name": "Relationship with Money and Self-Worth",
          "description": "my money and me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What influences your sense of deserving financial well-being?"
            },
            {
              "text": "Do you believe that you're not good enough for money? Where does this belief come from?"
            },
            {
              "text": "What would you do in life if money were no longer a limitation?"
            }
          ]
        },
        {
          "name": "Financial Fears",
          "description": "what I fear about money",
          "type": "Exploration",
          "questions": [
            {
              "text": "What financial worries keep you up at night?"
            },
            {
              "text": "What are you more afraid of: financial failure or success that would change everything about your life?"
            },
            {
              "text": "If money disappeared, what would you lose besides the money itself?"
            }
          ]
        },
        {
          "name": "Current Status",
          "description": "my money today",
          "type": "Foundation",
          "questions": [
            {
              "text": "How would you describe your current financial situation?"
            },
            {
              "text": "Where exactly are you investing your money right now – in your future (education, assets, investments) or in the present (comfort, entertainment, status purchases)?"
            },
            {
              "text": "What portion of your income do you allocate to personal development?"
            }
          ]
        },
        {
          "name": "Dreams and Motivation",
          "description": "what I dream of buying",
          "type": "Exploration",
          "questions": [
            {
              "text": "What do you envision when you dream of financial freedom?"
            },
            {
              "text": "What would you do if you had enough money to pursue any plans you wanted?"
            },
            {
              "text": "If you had all the necessary resources—time, money, and opportunities—what would you want to do?"
            }
          ]
        },
        {
          "name": "Goals and Strategy",
          "description": "where I want to get to",
          "type": "Exploration",
          "questions": [
            {
              "text": "What specific financial goal do you want to achieve within the year?"
            },
            {
              "text": "What financial goals would you like to achieve in five years?"
            },
            {
              "text": "Who can help you with your financial development: a mentor, a book, or a course?"
            },
            {
              "text": "What is the first concrete step you can take this week to move closer to your financial goals?"
            }
          ]
        },
        {
          "name": "Success and Transformation",
          "description": "where success leads me",
          "type": "Integration",
          "questions": [
            {
              "text": "What would you pursue if you knew you couldn't fail?"
            },
            {
              "text": "How would your life change if you achieved financial freedom?"
            }
          ]
        }
      ]
    },
    {
      "name": "Crisis 27 / 45",
      "blocks": [
        {
          "name": "Expectations vs Reality",
          "description": "my truth about the past",
          "type": "Foundation",
          "questions": [
            {
              "text": "When you were young, who did you imagine you would become at this age?"
            },
            {
              "text": "Who are you, really, at this moment? Does this align with your expectations?"
            },
            {
              "text": "What happened differently from what you planned?"
            },
            {
              "text": "What are you grateful for in your life not going according to plan?"
            }
          ]
        },
        {
          "name": "Wisdom from Mistakes",
          "description": "what life has taught me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What wisdom can be found in your mistakes?"
            },
            {
              "text": "What are the three most important life lessons you would pass on to those who come after you?"
            },
            {
              "text": "If you could change something in your past, what would it be?"
            },
            {
              "text": "For what are you grateful to your younger self?"
            }
          ]
        },
        {
          "name": "Current Crisis",
          "description": "what doesn't satisfy me",
          "type": "Foundation",
          "questions": [
            {
              "text": "What in your life is currently causing a crisis or a feeling of being stuck?"
            },
            {
              "text": "Have you lost the meaning in what used to energize you?"
            },
            {
              "text": "What changes in life are you currently dealing with in relationships, work, your view of yourself, or future plans?"
            }
          ]
        },
        {
          "name": "Reevaluation of Values",
          "description": "what has become most important",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which values used to seem important to you but have now lost their significance?"
            },
            {
              "text": "Which values have become more important to you than before?"
            },
            {
              "text": "If you could live the next 10 years differently, what would you change in your priorities and why?"
            }
          ]
        },
        {
          "name": "Possibility of Change",
          "description": "what is within my power",
          "type": "Exploration",
          "questions": [
            {
              "text": "Are there aspects of your life you want to radically change?"
            },
            {
              "text": "What’s stopping you from making the changes you want?"
            },
            {
              "text": "What would you be willing to give up to transform your life?"
            },
            {
              "text": "If you knew everything would work out, what changes would you dare to make in your life?"
            }
          ]
        },
        {
          "name": "New Meaning",
          "description": "who am I now",
          "type": "Integration",
          "questions": [
            {
              "text": "How do you see yourself in 10 to 15 years? Imagine and describe an ordinary day in that future life."
            },
            {
              "text": "How do you want to reinvent yourself?"
            },
            {
              "text": "What new purpose in life is emerging for you after the crisis?"
            }
          ]
        },
        {
          "name": "Action and Transition",
          "description": "my path out of crisis",
          "type": "Integration",
          "questions": [
            {
              "text": "What specific step can you take this week to begin your transition?"
            },
            {
              "text": "Whom will you tell about your crisis and seek support from?"
            }
          ]
        }
      ]
    },
    {
      "name": "AI Anxiety and the Future of Work",
      "blocks": [
        {
          "name": "My Value",
          "description": "what I can do",
          "type": "Foundation",
          "questions": [
            {
              "text": "What professional skills make you valuable and essential in your current job?"
            },
            {
              "text": "Which aspects of your work can't be replaced by a machine or AI?"
            },
            {
              "text": "Is emotional intelligence your primary professional asset? Why?"
            },
            {
              "text": "What do you do beyond your job description that your colleagues appreciate?"
            }
          ]
        },
        {
          "name": "Professional Identity",
          "description": "what I work as and take pride in",
          "type": "Exploration",
          "questions": [
            {
              "text": "Who are you professionally beyond your technical skills? What defines you as a professional?"
            },
            {
              "text": "What sets you apart from others in your field?"
            },
            {
              "text": "What skills or qualities do you possess that could become especially valuable in a world where technology is transforming the professional landscape?"
            }
          ]
        },
        {
          "name": "Signs of Anxiety",
          "description": "Do I like my work?",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which concerns you more: the possibility of losing your job or becoming professionally irrelevant?"
            },
            {
              "text": "How often do you feel professional anxiety about AI and technology?"
            },
            {
              "text": "What situations at work intensify your fear of inadequacy?"
            },
            {
              "text": "What methods do you typically use to cope with the fear of professional inadequacy?"
            }
          ]
        },
        {
          "name": "Retraining and Development",
          "description": "how I learn new things",
          "type": "Exploration",
          "questions": [
            {
              "text": "How many hours a week do you dedicate to reskilling and professional development?"
            },
            {
              "text": "What new skills or qualities do you want to develop in the coming year to feel more confident in a changing world?"
            },
            {
              "text": "Do you have a professional development plan in place if your current role becomes automated?"
            },
            {
              "text": "Which person, mentor, or community could help you develop your skills in working with new technologies?"
            }
          ]
        },
        {
          "name": "Rethinking Work",
          "description": "how I see work",
          "type": "Integration",
          "questions": [
            {
              "text": "If AI could do your job, what would you want to do instead? What unique value could you bring to the world?"
            },
            {
              "text": "If you had to start your career over from scratch right now, what would you study?"
            },
            {
              "text": "What professional qualities or experiences do you prefer to keep private? What remains out of the spotlight in your professional persona?"
            }
          ]
        },
        {
          "name": "Job Market and Opportunities",
          "description": "new opportunities for me",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which new professional niches are emerging due to AI and automation?"
            },
            {
              "text": "How can you use AI as an ally to enhance your professional expertise?"
            },
            {
              "text": "Which colleagues or peers in your field have successfully adapted to new technologies? What can you learn from them?"
            }
          ]
        },
        {
          "name": "Action and Strategy",
          "description": "my action plan",
          "type": "Integration",
          "questions": [
            {
              "text": "What is the first concrete step you will take this week to better prepare yourself for the changes in the world of work?"
            },
            {
              "text": "What new skill or knowledge do you want to acquire in the next three months?"
            },
            {
              "text": "How will you track your progress in adapting to professional changes?"
            }
          ]
        }
      ]
    },
    {
      "name": "Info-obesity",
      "blocks": [
        {
          "name": "Consumption Awareness",
          "description": "where does my time go",
          "type": "Foundation",
          "questions": [
            {
              "text": "How much time do you spend each day on digital platforms such as social media, news, and messaging apps?"
            },
            {
              "text": "Which three apps do you open first in the morning?"
            },
            {
              "text": "When was the last time you spent a day without notifications, either by turning them off completely or switching to \"Do Not Disturb\" mode?"
            },
            {
              "text": "Do you open apps with a conscious purpose or just out of habit?"
            }
          ]
        },
        {
          "name": "Feelings and Signals",
          "description": "how I feel",
          "type": "Exploration",
          "questions": [
            {
              "text": "What happens to your body when your screen floods with notifications, and what signals does it send you?"
            },
            {
              "text": "What emotions arise after an hour in the information stream: calmness, confusion, or overload?"
            },
            {
              "text": "When you feel the urge to check something on your phone or computer, what do you actually need at that moment?"
            }
          ]
        },
        {
          "name": "Fears and Motives",
          "description": "what I fear and desire",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are you afraid of missing in your information feed?"
            },
            {
              "text": "If you stopped checking the news for a week, what would you lose? What would you gain?"
            },
            {
              "text": "How does your digital consumption help you avoid things like boredom, loneliness, or self-reflection?"
            }
          ]
        },
        {
          "name": "Boundary and Saturation",
          "description": "when there's enough information",
          "type": "Exploration",
          "questions": [
            {
              "text": "Where do you draw the line between staying well-informed and experiencing information overload?"
            },
            {
              "text": "How much information do you truly need in a day? How do you know when you've had enough?"
            },
            {
              "text": "Which content is genuinely useful to you, and which do you consume on autopilot?"
            }
          ]
        },
        {
          "name": "From Consumption to Creation",
          "description": "how to become a creator",
          "type": "Exploration",
          "questions": [
            {
              "text": "What would happen if you stopped merely consuming and started creating instead?"
            },
            {
              "text": "What content or idea would you like to create instead of endlessly consuming?"
            },
            {
              "text": "How often do you write, draw, or create something of your own compared to the time you spend consuming content?"
            }
          ]
        },
        {
          "name": "Identity without digits",
          "description": "my real face",
          "type": "Exploration",
          "questions": [
            {
              "text": "How do you perceive yourself without your digital footprint, ratings, and likes?"
            },
            {
              "text": "What aspects of your personality do you reveal online, and which do you keep hidden?"
            },
            {
              "text": "If all your digital accounts disappeared tomorrow, what would change about who you are?"
            }
          ]
        },
        {
          "name": "Independence",
          "description": "who am I without the internet",
          "type": "Exploration",
          "questions": [
            {
              "text": "Can you spend a day without your smartphone? How does that make you feel?"
            },
            {
              "text": "When was the last time you deeply reflected on something, relying solely on your own thoughts?"
            },
            {
              "text": "What decision have you made in the last month based solely on your own experience, without consulting Google or the internet?"
            }
          ]
        },
        {
          "name": "Action and Balance",
          "description": "my first steps",
          "type": "Integration",
          "questions": [
            {
              "text": "What specific digital boundary will you set for yourself this week?"
            },
            {
              "text": "Which app or habit are you willing to delete or limit?"
            },
            {
              "text": "Which offline activity would you like to reintroduce into your life?"
            },
            {
              "text": "How will you track your progress in achieving digital balance?"
            }
          ]
        }
      ]
    },
    {
      "name": "Learned Helplessness 2.0",
      "blocks": [
        {
          "name": "Where I Lose My Power",
          "description": "what drains my energy",
          "type": "Foundation",
          "questions": [
            {
              "text": "What often paralyzes you in moments when you need to take action?"
            },
            {
              "text": "Where does your actual circle of influence end, and what lies beyond your control?"
            },
            {
              "text": "In what situations do you tend to feel powerless or helpless?"
            },
            {
              "text": "What happens to your body when you feel powerless? What signals does it send you?"
            }
          ]
        },
        {
          "name": "Information trap",
          "description": "when I stop trying",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which news sources and information feeds are shaping your worldview?"
            },
            {
              "text": "How much time do you spend each day consuming information that paralyzes you?"
            },
            {
              "text": "Whose views and beliefs do you adopt as your own without checking if they truly align with your personal experience?"
            }
          ]
        },
        {
          "name": "Fears and Choice",
          "description": "what stops me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are you more afraid of—failure or inaction?"
            },
            {
              "text": "What does your inner critic tell you that you can't do? Where do you think these beliefs originated?"
            },
            {
              "text": "What hope have you already given up on, and do you want to reclaim it?"
            }
          ]
        },
        {
          "name": "Illusion of Control",
          "description": "what I want to hold in my hands",
          "type": "Exploration",
          "questions": [
            {
              "text": "What would happen if you stopped trying to control what is beyond your control?"
            },
            {
              "text": "In which areas of your life do you feel you're striving to make a change, but the results remain unchanged?"
            },
            {
              "text": "If you focused only on what is truly within your control, how would this change your attitude toward life?"
            }
          ]
        },
        {
          "name": "Personality Parts and Resistance",
          "description": "who inside me is afraid",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which part of you is afraid to take action? What is it protecting?"
            },
            {
              "text": "What do you gain from remaining helpless? What does inaction provide you?"
            },
            {
              "text": "If one part of you was afraid while another part was ready to take action, what would that ready part say?"
            }
          ]
        },
        {
          "name": "Competence and Success History",
          "description": "what I'm good at",
          "type": "Exploration",
          "questions": [
            {
              "text": "When was the last time you felt competent and capable of making a difference?"
            },
            {
              "text": "What small actions or habits have helped you achieve results?"
            },
            {
              "text": "In which area of your life do you feel most influential and capable?"
            }
          ]
        },
        {
          "name": "From Helplessness to Agency",
          "description": "where success leads me",
          "type": "Exploration",
          "questions": [
            {
              "text": "Who are you when you're not paralyzed by helplessness?"
            },
            {
              "text": "What decisions can you make today to feel more in control of your life?"
            },
            {
              "text": "If you took full responsibility for the aspects of your life within your control, how might this change your decisions and actions?"
            }
          ]
        },
        {
          "name": "Action",
          "description": "first steps towards change",
          "type": "Integration",
          "questions": [
            {
              "text": "What specific step can you take today to feel more confident in your abilities?"
            },
            {
              "text": "What habitual worry are you ready to let go of this week?"
            },
            {
              "text": "What new habit will you adopt to enhance your sense of competence?"
            }
          ]
        }
      ]
    },
    {
      "name": "Parasocial Dependency",
      "blocks": [
        {
          "name": "Mapping My World",
          "description": "my real relationships",
          "type": "Foundation",
          "questions": [
            {
              "text": "How many people in your life truly know the real you, without any masks or pretenses?"
            },
            {
              "text": "How many hours per week do you spend with real people in person? Is that enough for you?"
            },
            {
              "text": "Which people you know only online would you most like to meet in real life?"
            },
            {
              "text": "What kind of content helps you feel less lonely?"
            }
          ]
        },
        {
          "name": "Sources of Closeness",
          "description": "who supports me",
          "type": "Exploration",
          "questions": [
            {
              "text": "Who among the real people in your life gives you the most emotional support?"
            },
            {
              "text": "Which influencer, character, or AI makes you feel supported? What is it about them specifically?"
            },
            {
              "text": "What needs for closeness and understanding are fulfilled by interacting with virtual companions for you?"
            },
            {
              "text": "What genuine need does virtual content fulfill for you?"
            }
          ]
        },
        {
          "name": "Escape and Avoidance",
          "description": "what I avoid in life",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are you running from when you fall into endless scrolling?"
            },
            {
              "text": "What does virtuality replace for you in terms of real human touch and intimacy?"
            },
            {
              "text": "Which real people or situations are you avoiding through the screen?"
            },
            {
              "text": "If you disconnected from all virtual relationships for a week, what would you miss?"
            }
          ]
        },
        {
          "name": "The Proximity Paradox",
          "description": "when the screen is closer than people",
          "type": "Exploration",
          "questions": [
            {
              "text": "Why do virtual relationships seem easier to you than real ones?"
            },
            {
              "text": "What advantages do virtual relationships offer you?"
            },
            {
              "text": "What risks and challenges accompany virtual intimacy?"
            }
          ]
        },
        {
          "name": "Authentic Self",
          "description": "my true face",
          "type": "Exploration",
          "questions": [
            {
              "text": "When was the last time you felt genuine closeness—without a screen, without filters?"
            },
            {
              "text": "Who are you when no one sees your posts, likes, or online status?"
            },
            {
              "text": "What aspects of yourself do you reveal online but conceal in face-to-face interactions?"
            },
            {
              "text": "If all your virtual relationships disappeared tomorrow, would anything change about who you truly are?"
            }
          ]
        },
        {
          "name": "Authenticity Recovery",
          "description": "returning to my true self",
          "type": "Exploration",
          "questions": [
            {
              "text": "What needs to change in your life to cultivate more authentic relationships?"
            },
            {
              "text": "What genuine human connections can you cultivate to meet real needs?"
            },
            {
              "text": "To whom in your life would you like to share the thoughts you usually keep for online conversations?"
            },
            {
              "text": "What step could you take today to meaningfully reconnect with someone who matters to you?"
            }
          ]
        },
        {
          "name": "Boundaries and Balance",
          "description": "how not to get lost online",
          "type": "Integration",
          "questions": [
            {
              "text": "Which virtual relationships or content should you keep because they genuinely help you?"
            },
            {
              "text": "How can you enjoy the internet while maintaining your authentic connections?"
            },
            {
              "text": "What boundaries do you want to establish for yourself between the online and offline worlds?"
            }
          ]
        }
      ]
    },
    {
      "name": "Hybrid Life — Remote Work",
      "blocks": [
        {
          "name": "Space Transformation",
          "description": "my world before and after",
          "type": "Foundation",
          "questions": [
            {
              "text": "How has your relationship with home changed since transitioning to hybrid work?"
            },
            {
              "text": "What has remote work brought into your life?"
            },
            {
              "text": "What did you lose when your office became your bedroom?"
            },
            {
              "text": "How have your personal space and energy changed after the complete digital shift?"
            }
          ]
        },
        {
          "name": "Fatigue and Triggers",
          "description": "what drains my energy",
          "type": "Exploration",
          "questions": [
            {
              "text": "How many virtual meetings per week start to drain your internal resources?"
            },
            {
              "text": "What happens to your body when you feel tired? What signals does it send?"
            },
            {
              "text": "Which digital habits have become invisible chains for you?"
            },
            {
              "text": "How do your body and mind signal that you are overworked?"
            }
          ]
        },
        {
          "name": "Sacrifices and Priorities",
          "description": "what I'm giving up",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are you sacrificing by spending more and more time in the digital world?"
            },
            {
              "text": "What important things in your life are you neglecting because of work?"
            },
            {
              "text": "How much energy do you spend maintaining your professional facade in different situations?"
            }
          ]
        },
        {
          "name": "Boundaries",
          "description": "when there's enough information",
          "type": "Exploration",
          "questions": [
            {
              "text": "What are your current boundaries between work and personal life?"
            },
            {
              "text": "What would happen if you turned off notifications after 6 p.m.?"
            },
            {
              "text": "What ritual or routine signifies your transition from work to personal life?"
            },
            {
              "text": "How do the people close to you feel about your constant online presence?"
            }
          ]
        },
        {
          "name": "Role Separation",
          "description": "what's mine and what's work",
          "type": "Exploration",
          "questions": [
            {
              "text": "Where does your professional role end, and where does your personal identity begin?"
            },
            {
              "text": "How do you transition from worker to person at home?"
            },
            {
              "text": "What aspects of yourself do you not reveal at work?"
            }
          ]
        },
        {
          "name": "Identity and Digital Footprint",
          "description": "my online and offline image",
          "type": "Exploration",
          "questions": [
            {
              "text": "Who are you when you turn off all notifications and put your phone away?"
            },
            {
              "text": "Which version of yourself do you present in the online world, and what remains behind the scenes?"
            },
            {
              "text": "If you lost internet access for a week starting tomorrow, who would you discover yourself to be?"
            }
          ]
        },
        {
          "name": "Hybrid Opportunities",
          "description": "my advantages today",
          "type": "Exploration",
          "questions": [
            {
              "text": "What advantages of hybrid living do you already value?"
            },
            {
              "text": "How can you better leverage the opportunities of a hybrid lifestyle for personal development?"
            },
            {
              "text": "What freedoms has remote work brought into your life?"
            }
          ]
        },
        {
          "name": "Action and Integration",
          "description": "how I will put it all together",
          "type": "Integration",
          "questions": [
            {
              "text": "What boundary will you set this week between work and your personal life?"
            },
            {
              "text": "What \"switching off\" ritual will you incorporate into your day?"
            },
            {
              "text": "How will you know when your balance is restored?"
            }
          ]
        }
      ]
    },
    {
      "name": "Authenticity vs Algorithms",
      "blocks": [
        {
          "name": "Mapping of Masks",
          "description": "my different faces",
          "type": "Foundation",
          "questions": [
            {
              "text": "What different versions of yourself do you present in various contexts—social media, work, family, or among friends?"
            },
            {
              "text": "Which platforms do you use? Are you the same person on all of them?"
            },
            {
              "text": "How many times a day do you edit, filter, or hide your image?"
            },
            {
              "text": "How would your life change if you stopped trying to adjust your image to meet other people's expectations?"
            }
          ]
        },
        {
          "name": "Content and Authenticity",
          "description": "my posts and me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What content do you create out of boredom, social pressure, or the desire to be liked?"
            },
            {
              "text": "What content do you create genuinely, from the heart?"
            },
            {
              "text": "How does your online personality differ from your real-life self?"
            }
          ]
        },
        {
          "name": "Authenticity Risks",
          "description": "what I fear in myself",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which aspects of your personality become invisible in the digital space?"
            },
            {
              "text": "Which part of yourself do you hide out of fear of judgment?"
            },
            {
              "text": "What makes showing your true emotions online feel risky to you?"
            },
            {
              "text": "What people or situations cause you to wear a mask?"
            }
          ]
        },
        {
          "name": "The Boundary Between Presentation and Censorship",
          "description": "when there is enough information",
          "type": "Exploration",
          "questions": [
            {
              "text": "Where do you draw the line between healthy self-presentation and self-censorship?"
            },
            {
              "text": "What aspects of your life do you prefer to keep private, and what influences this decision?"
            },
            {
              "text": "Do you have people or communities where you can be completely yourself?"
            }
          ]
        },
        {
          "name": "Choice between acceptance and authenticity",
          "description": "to be yourself or to be liked",
          "type": "Exploration",
          "questions": [
            {
              "text": "How do you choose between authenticity and acceptance?"
            },
            {
              "text": "What content would you create if there were no likes or ratings?"
            },
            {
              "text": "If you were completely anonymous online, who would you be?"
            }
          ]
        },
        {
          "name": "Authenticity in the Age of Algorithms",
          "description": "my true face",
          "type": "Exploration",
          "questions": [
            {
              "text": "Where is your authenticity right now—online or offline?"
            },
            {
              "text": "Which parts of you feel authentic and don't need any filter?"
            },
            {
              "text": "If your online version and your real-life version could meet, what would they say to each other?"
            }
          ]
        },
        {
          "name": "Authenticity Recovery",
          "description": "how to find your true self",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which aspect of yourself are you ready to reveal more openly?"
            },
            {
              "text": "With whom would you want to share your authentic self? Who are these people?"
            },
            {
              "text": "What authentic piece of content would you create if you weren't afraid?"
            }
          ]
        },
        {
          "name": "Action and Balance",
          "description": "how to be yourself online",
          "type": "Integration",
          "questions": [
            {
              "text": "What truth about yourself are you ready to accept right now?"
            },
            {
              "text": "How will you measure your authenticity: by likes or by your inner sense?"
            },
            {
              "text": "What digital detox ritual could you introduce into your life?"
            }
          ]
        }
      ]
    },
    {
      "name": "Eco-guilt and Climate Anxiety",
      "blocks": [
        {
          "name": "My Consumption",
          "description": "my purchases and habits",
          "type": "Foundation",
          "questions": [
            {
              "text": "What goods and services do you consume daily? Do you ever think about where they come from?"
            },
            {
              "text": "What consumer habits did you inherit from your parents?"
            },
            {
              "text": "What eco-friendly habits do you already have? What would you like to add or change about your consumption?"
            },
            {
              "text": "What is the environmental cost of your typical day?"
            }
          ]
        },
        {
          "name": "Guilt and Responsibility",
          "description": "Do I like my work?",
          "type": "Exploration",
          "questions": [
            {
              "text": "How much energy do you spend on eco-guilt rather than taking action?"
            },
            {
              "text": "Which scares you more: the discomfort of changing your lifestyle or the consequences of the climate crisis?"
            },
            {
              "text": "Where does personal responsibility end and systemic responsibility begin?"
            },
            {
              "text": "How often do you find yourself paralyzed by guilt instead of taking action?"
            }
          ]
        },
        {
          "name": "Emotions and Denial",
          "description": "what I hide from myself",
          "type": "Exploration",
          "questions": [
            {
              "text": "What pain regarding nature and its suffering are you suppressing within yourself?"
            },
            {
              "text": "When was the last time you allowed yourself to experience climate anxiety without judgment?"
            },
            {
              "text": "What do you rationalize or deny regarding environmental issues?"
            }
          ]
        },
        {
          "name": "Personal Choice",
          "description": "what is in my hands",
          "type": "Exploration",
          "questions": [
            {
              "text": "What is one personal choice you can make that truly makes a difference?"
            },
            {
              "text": "What small actions are you already taking, and do they have value?"
            },
            {
              "text": "If you knew for certain that your actions would help the planet, what would you change in your life?"
            }
          ]
        },
        {
          "name": "Identity and System",
          "description": "my place in the world",
          "type": "Exploration",
          "questions": [
            {
              "text": "Who are you beyond your consumer choices?"
            },
            {
              "text": "How do the system—encompassing corporations, government, and the economy—influence your choices?"
            },
            {
              "text": "Can you be environmentally conscious within a non-ecological system? How?"
            }
          ]
        },
        {
          "name": "From Guilt to Action",
          "description": "what I do for the planet",
          "type": "Exploration",
          "questions": [
            {
              "text": "From what eco-guilt are you ready to release yourself?"
            },
            {
              "text": "What small action can you incorporate into your life starting today to feel more whole and complete in ecological matters?"
            },
            {
              "text": "Who or what can support you in making environmentally friendly choices?"
            },
            {
              "text": "How will you track your progress—by materials/content or by your inner sense?"
            }
          ]
        },
        {
          "name": "Activism and Consistency",
          "description": "what I do for the planet",
          "type": "Integration",
          "questions": [
            {
              "text": "Is there an environmental cause that inspires you, and why?"
            },
            {
              "text": "How would you like to participate: through personal actions, educating others, or activism?"
            },
            {
              "text": "What role would you like to play in creating a healthier world?"
            },
            {
              "text": "What achievements make you proud? What in your life fills you with a sense of pride?"
            },
            {
              "text": "Which achievements are you most proud of?"
            },
            {
              "text": "How can you derive even more pleasure from the process of achieving your environmental goals?"
            },
            {
              "text": "What is inherently valuable about you, independent of your environmental actions and achievements?"
            }
          ]
        }
      ]
    },
    {
      "name": "Impostor Syndrome in the LinkedIn Era",
      "blocks": [
        {
          "name": "Symptoms and triggers",
          "description": "when doubt overwhelms you",
          "type": "Foundation",
          "questions": [
            {
              "text": "In which moments do you feel you're not competent enough for your role?"
            },
            {
              "text": "How does reading your colleagues' success posts on social media affect your self-esteem?"
            },
            {
              "text": "Are you worried that one day someone will tap you on the shoulder and say, \"You don't belong here; leave\"?"
            }
          ]
        },
        {
          "name": "Attribution of Merit",
          "description": "my achievements or luck",
          "type": "Exploration",
          "questions": [
            {
              "text": "How often do you attribute your successes to just getting lucky, coincidence, or the help of the team?"
            },
            {
              "text": "List three undeniable facts about your career, including numbers or completed projects."
            },
            {
              "text": "What achievements are you genuinely proud of, even if no one liked your post?"
            }
          ]
        },
        {
          "name": "Disconnect from Reality",
          "description": "my social media mask",
          "type": "Exploration",
          "questions": [
            {
              "text": "Compare your public profile (resume) with your internal sense of self—how big is the gap?"
            },
            {
              "text": "Which professional insecurity do you prefer to keep to yourself rather than discuss with colleagues?"
            },
            {
              "text": "What's the worst thing that could happen if you said, I don't know the answer to that question?"
            }
          ]
        },
        {
          "name": "Value and Identity",
          "description": "what matters to me",
          "type": "Exploration",
          "questions": [
            {
              "text": "How do you most often think about yourself—through your achievements (I’m the person who did this) or through your inherent qualities (I’m this kind of person)?"
            },
            {
              "text": "Who are you without your job titles, projects, and professional positions?"
            },
            {
              "text": "How can you find fulfillment in the process of working toward your goals, not just at the moment you achieve them?"
            }
          ]
        },
        {
          "name": "Breaking Free from the Race",
          "description": "how to live without comparisons",
          "type": "Integration",
          "questions": [
            {
              "text": "Whose opinion or approval do you still need to feel like a genuine professional?"
            },
            {
              "text": "What advice would you give to a friend if they felt as insecure as you do right now?"
            },
            {
              "text": "What are you ready to do today, knowing you're good enough for it?"
            },
            {
              "text": "Which field consumes most of your time and energy right now?"
            },
            {
              "text": "Why do I believe this will work? What is my confidence in this path based on? Is there a more effective way? How can I find out?"
            },
            {
              "text": "If you could choose without any limitations, where would you want to work?"
            },
            {
              "text": "🚨 Which is more painful for you right now: getting rejected in job interviews or continuing to work where your worth isn't recognized?"
            },
            {
              "text": "Do you criticize yourself for resting, even when you have a lot of work and responsibilities?"
            },
            {
              "text": "How long would your savings last if you decided to take a break from work?"
            },
            {
              "text": "How does your current job help you achieve what truly matters to you?"
            },
            {
              "text": "Which aspects of your current job don't align with the goals that truly matter to you?"
            },
            {
              "text": "How much satisfaction does your current job bring you? Rate it on a scale of 1 to 10."
            },
            {
              "text": "What would your ideal job be?"
            }
          ]
        }
      ]
    },
    {
      "name": "Sunday Anxiety",
      "blocks": [
        {
          "name": "Grounding",
          "description": "what my body feels",
          "type": "Foundation",
          "questions": [
            {
              "text": "How would you describe your current state in three words? For example, tiredness, worry, anticipation."
            },
            {
              "text": "When does rest stop being rest? Have you ever noticed that moment when relaxation shifts into an inner anticipation of Monday?"
            },
            {
              "text": "How do you feel about how you spent this weekend?"
            },
            {
              "text": "If tomorrow weren't Monday, how would you spend this evening?"
            }
          ]
        },
        {
          "name": "Monster Analysis",
          "description": "my main fears",
          "type": "Exploration",
          "questions": [
            {
              "text": "Which specific event or task coming up this week is causing you the most stress?"
            },
            {
              "text": "Is this tension due to a fear of not coping, boredom, or dealing with unpleasant people?"
            },
            {
              "text": "On a scale of 1 to 10, how satisfied are you with your overall work?"
            },
            {
              "text": "Is there a real threat in what’s worrying you, or is it just a pattern of worry?"
            }
          ]
        },
        {
          "name": "Boundaries and Resources",
          "description": "what will help me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What is the kindest and most caring thing you can do for yourself right now?"
            },
            {
              "text": "What small ritual tomorrow morning will help you start your day more gently?"
            },
            {
              "text": "Who or what can support you this week?"
            }
          ]
        },
        {
          "name": "Global Reality Check",
          "description": "when anxiety doesn't let go",
          "type": "Integration",
          "questions": [
            {
              "text": "Consider whether the fear of change outweighs the pain of working somewhere you're not valued — which feels heavier right now?"
            },
            {
              "text": "Your dream job — is there room for Sunday blues?"
            },
            {
              "text": "What step will you take this week to bring your reality a little closer to that dream?"
            },
            {
              "text": "If your Sunday anxiety could speak, what would it be trying to tell you about your life?"
            },
            {
              "text": "Will you still feel this way every Sunday five years from now?"
            },
            {
              "text": "What needs to change in your life for Sunday to be just Sunday again?"
            }
          ]
        }
      ]
    },
    {
      "name": "Parental Guilt Over Screen Time",
      "blocks": [
        {
          "name": "Honest Diagnosis",
          "description": "what is really happening",
          "type": "Foundation",
          "questions": [
            {
              "text": "How many hours a day does your child spend in front of a screen, and how many of those hours are so you can take a break?"
            },
            {
              "text": "Are you familiar with the storyline of your child's favorite game or cartoon?"
            },
            {
              "text": "How much time do you spend on your phone when your child is in the same room?"
            }
          ]
        },
        {
          "name": "Anatomy of Guilt",
          "description": "what is happening to me",
          "type": "Exploration",
          "questions": [
            {
              "text": "What do you feel in the moment when you hand your child the tablet: relief, irritation, or shame?"
            },
            {
              "text": "What is your deepest fear when you think about your child's screen time?"
            },
            {
              "text": "Do you believe that a good parent should entertain their child 24/7 without any help from devices?"
            }
          ]
        },
        {
          "name": "Hidden Meanings",
          "description": "what lies behind the guilt",
          "type": "Integration",
          "questions": [
            {
              "text": "What anxiety of your own are you trying to soothe when you take away devices or get angry about them?"
            },
            {
              "text": "Reflecting on your childhood, what did you lack that you are now trying to compensate for or prohibit for your child?"
            },
            {
              "text": "What is truly driving your arguments with your child about phone time? Could it be your way of connecting when you can't find other reasons to talk?"
            }
          ]
        },
        {
          "name": "Digital Bridge",
          "description": "what to do next",
          "type": "Integration",
          "questions": [
            {
              "text": "What if the screen isn’t a wall between you but a door? How can you walk through that door together with your child?"
            },
            {
              "text": "Who will you become for your child if you stop being a censor and become a guide in the digital world?"
            },
            {
              "text": "What is one gadget-free family ritual you could introduce that would bring genuine joy to both of you, rather than feeling like a healthy obligation?"
            },
            {
              "text": "How much time do you spend each day monitoring cryptocurrency charts?"
            },
            {
              "text": "Which channels and bloggers influence your investment decisions?"
            },
            {
              "text": "What beliefs about money and technology influence your decisions when purchasing gadgets for your child?"
            },
            {
              "text": "What is truly driving your desire to make quick money?"
            },
            {
              "text": "What inner voids are you trying to fill by chasing cryptocurrency trends?"
            },
            {
              "text": "What uncomfortable feelings about yourself are you avoiding by spending time on your phone?"
            },
            {
              "text": "Which aspect of your vulnerability are you concealing behind your digital habits?"
            },
            {
              "text": "Who are you without screens, notifications, and digital achievements?"
            }
          ]
        }
      ]
    },
    {
      "name": "Cryptocurrency FOMO",
      "blocks": [
        {
          "name": "Digital Pulse",
          "description": "where am I with crypto",
          "type": "Foundation",
          "questions": [
            {
              "text": "How often do you check your portfolio or charts? Be honest: once a day, every hour, or with every notification?"
            },
            {
              "text": "Does the market's performance affect your mood? When the market is down, how does that impact your interactions with family and loved ones?"
            },
            {
              "text": "Do you sleep with your phone, fearing you'll miss price movements overnight?"
            }
          ]
        },
        {
          "name": "Social Mirror",
          "description": "what other people think",
          "type": "Exploration",
          "questions": [
            {
              "text": "Whose success in crypto triggers complicated feelings in you? Who do you follow?"
            },
            {
              "text": "Do you believe that others are making money easily and quickly while you're missing out on opportunities?"
            },
            {
              "text": "Which feeling is stronger: the joy from your profits or the frustration that you could have made more?"
            }
          ]
        },
        {
          "name": "Magical Thinking",
          "description": "my dreams of easy money",
          "type": "Exploration",
          "questions": [
            {
              "text": "Did you get into crypto to preserve your capital or to quickly transform your life and escape from reality?"
            },
            {
              "text": "Do you approach crypto investing as a calculated strategy or a form of gambling?"
            },
            {
              "text": "What gives you the feeling of being \"in the market\"—a connection to the future, excitement, or a sense of superiority?"
            }
          ]
        },
        {
          "name": "Identity",
          "description": "who am I without the hype",
          "type": "Exploration",
          "questions": [
            {
              "text": "Who are you without your digital assets and virtual achievements?"
            },
            {
              "text": "If the entire crypto market disappeared tomorrow, what solid skills and real values would you still retain?"
            }
          ]
        },
        {
          "name": "Crypto Detox",
          "description": "how to stop tracking",
          "type": "Integration",
          "questions": [
            {
              "text": "How much money are you willing to lose without regret and without it affecting your quality of life? (Assess your true risk tolerance)"
            },
            {
              "text": "Which digital wellness rules are you ready to implement to reclaim your peaceful sleep?"
            }
          ]
        }
      ]
    }
  ]
}